{
  "meta": {
    "theme": "elegant"
  },
  "basics": {
    "name": "Diksha Gabha",
    "label": "Software Developer",
    "summary": "Experienced Django Developer passionate about building scalable web applications. Skilled in MVC architecture, ORM, and RESTful APIs. Dedicated to delivering high-quality code and staying updated with the latest technologies. Proactive problem solver with attention to detail.",
   
    "email": "diksha.gabha95@gmail.com",
    "location": {
      "city": "Bangalore",
      "countryCode": "IN"
    },
    "profiles": [
      {
        "username": "diksha-gabha-3a02bb117",
        "url": "https://www.linkedin.com/in/diksha-gabha-3a02bb117/",
        "network": "linkedin"
      }
    ]
  },
  "education": [
    {
      "endDate": "2015",
      "startDate": "2018",
      "area": "M.C.A",
      "studyType": "Masters",
      "institution": "Panjab University"
    },
    {
      "endDate": "2015",
      "startDate": "2012",
      "area": "B.Sc",
      "studyType": "Bachlors",
      "institution": "Panjab University"
    }
  ],
 
  "skills": [
    {
      "keywords": [
        "Python",
        "Django",
        "MySql",
        "HTML/CSS",
        "Php",
        "Laravel"
      ],
      "level": "Senior",
      "name": "Backend"
    },
   
  ],
 
  "work": [
    {
    
      "name": "Mphasis",
      "location": "Bangalore",
      "position": "Senior Software Developer",
      "startDate": "2023-02",
      "highlights": ["The primary focus of the project is to allow users to upload, organize, and manage PDF documents securely. Expertise in Django's file handling capabilities and database integration ensured a seamless experience for users to store and access their PDF files.",
					"Developed a responsive web application using Django and front-end frameworks (e.g., Bootstrap), ensuring seamless functionality across desktop, tablet, and mobile devices.",
					"Designed and Integrated the application's database, ensuring data integrity, optimization, and scalability. Proficiency in working with SQL databases and Django's Object-Relational Mapping (ORM) is essential for the success of this project."]
    },
    {
      
      "name": "Daffodil Software",
      "location": "Gurgaon",
      "position": "Senior Software Developer",
      "startDate": "2019-08",
      "endDate": "2023-02",
      "highlights": [
				"Created a tool to automate google pagespeed’s score to calculate values at every hour of day and get a mail at midnight for average of data with pass/fail test cases made in core python and implemented on web server. Maintaining ad hoc requests for client on a regular basis in odd shifts. ", 
				" Working on project changes with new implementations as per client’s requests.",
				"Implemented python libraries like numpy, pandas.Working with creating ruby scripts on daily basis as per customer’s requests",
				"Worked with managing data from REST apis and updating it with the system. Manually integrated different plugins and modules on ongoing projects",
				"Worked on the server based setup challenges/edits for projects.Maintained timely communications with clients and business partners. Worked on company’s internal module creation for donations which includes integration of multiple payment gateways and third party user management systems.Integrating the basic structuring of data using jQuery and javascript."
      ]
    },
    {
      
      "name": "Assisteasy",
      "location": "Gurgaon",
      "position": "Software Developer",
      "startDate": "2019-04",
      "endDate": "2023-07",
      "highlights": [
      	"Created a module that creates orders as per client’s predefined calculation values.",
		"Integrated cc-avenue payment gateway in the project to handle order payments.",
		"Created RESTful apis to be used by mobile apps."
		]
    },
    
  ],
 
}
